package homework1;

import java.util.Scanner;

public class task8 {

	public static void main(String[] args) {
		// Задача 8:
		// Да се състави програма, която чете от конзолата 4-цифренo
		// естествено число от интервала [1000.. 9999]. От това число се
		// формират 2 нови 2-цифрени числа. Първото число се формира от 1-та
		// и 4-та цифра на въведеното число. Второто число се формира от 2-рa -
		// 3-та цифра на въведеното число. Като резултат да се изведе дали 1-то
		// ново число e по-малко <, равно = или по-голямо от 2-то число.
		// Пример: 3332 Изход: по-малко (32<33)
		// Пример: 1144 Изход: равни (14=14)
		// Пример: 9875 Изход: по-голямо (95>87)
		Scanner sc = new Scanner(System.in);
		System.out.println("Въведете четерицифрено число : ");
		int num = sc.nextInt();
		if (!((num >= 1000) || (num <= 9999))) {
			System.out.println("Въвели сте невалиден номер.");
		} else {
			int num1 = (((num / 1000) * 10) + (num % 10));
			int num2 = (((num % 1000) / 100) * 10 + (num % 100) / 10);
			if (num1 < num2) {
				System.out.println("по-малко (" + num1 + " < " + num2 + ")");
			}
			if (num2 < num1) {
				System.out.println(" по-голямо (" + num1 + " > " + num2 + ")");

			}
			if (num2 == num1) {
				System.out.println(" равни (" + num1 + " = " + num2 + ")");
			}
		}
	}
}

